/* C++ cgbldf.pl1 - Static external data initialization (-defext) */

/***********************************************************************
 * This product is the property of Language Processors, Inc. and is    *
 * licensed pursuant to a written license agreement.  No portion of    *
 * this product may be reproduced without the written permission of    *
 * Language Processors, Inc. except pursuant to the license agreement. *
 ***********************************************************************/

/***********************************************************************
 *
 *  LPI EDIT HISTORY               [ Update the VERSION__ string below ]
 *
 *  06.06.90  DGM  006  Updated for the new utilities.
 *  04.19.90  DGM  005  Added C_DATA_INITIAL_FILE_PKG.
 *  02.09.90  DGM  004  Changed C_SIZET_IN to C_TYPE_SIZE_IN.
 *  01.31.90  TLF  003  Added C_SIZET_IN, which defines the expression
 *                      parser size and type information tables.
 *
 *  09.28.89  DGM  000  Original.
 *
 ***********************************************************************/

/* ---------------------------------------------------------------------
/* Version and copyright stamp
/* ------------------------------------------------------------------- */

declare	VERSION__	character (80) varying static internal initial

('@(#)CGBLDF  006  6/6/90  (c) 1990 Language Processors, Inc.');

CGBLDF: procedure;

%include 'incfil';
%include GBL_CONSTANTS_IN;
%include C_UTL_DEFS_IN;
%include C_UTL_VALUE_NODE_PKG;
%include C_STANDARD_DEFS_IN;
%include C_EXTERNAL_NAME_MAP_IN;
%include C_SYSTEM_IN;
%include C_GLOBAL_IN;
%include C_DEBUG_SWITCHES_IN;
%include C_LEXER_PKG;
%include C_PARSER_PKG;
%include C_DATA_INITIAL_FILE_PKG;
%include C_PAR_TABLE_IN;
%include C_PAR_TERMINALS_IN;
%include C_SYMBOL_TABLE_IN;
%include C_VOP_DEFS_IN;
%include C_TYPE_MAP_IN;
%include C_TOKEN_MAP_TERMINAL_IN;
%include C_TOKEN_MAP_DECLARATION_IN;
%include C_TOKEN_MAP_SPELLING_IN;
%include C_TOKEN_MAP_OP_IN;
%include C_SOURCE_MGR_IN;
%include C_GLOBAL_DECLARATION_DATA_IN;
%include C_GLOBAL_EXPRESSION_DATA_IN;
%include C_GLOBAL_STATEMENT_DATA_IN;
%include C_GLOBAL_SEMANTIC_DATA_IN;
%include C_TYPE_SIZE_IN;

declare

NODE_PTR	pointer,
CURRENT_OP	pointer;

end CGBLDF;

