/* LPI-DEBUG M68 SGETFP.PL1 - Return the current user frame pointer */

/**********************************************************************/
/* This product is the property of Language Processors, Inc.          */
/* and is licensed pursuant to a written license agreement.           */
/* No portion of this product may be reproduced without the written   */
/* permission of Language Processors, Inc. except pursuant to the     */
/* license agreement.                                                 */
/**********************************************************************/

/***********************************************************************
 *
 *  LPI EDIT HISTORY
 *
 *  04.02.87  DGM  Moved from UNIX to M68 divergence.
 *
 **********************************************************************/

SGETFP: procedure returns (fixed binary (31));

%include 'incfil';
%include GLOBAL_IN;
%include DBGGLOBAL_IN;
%include TARGET_IN;

     return (PROGRAM_REGISTER_AREA->REGS.A6);

end SGETFP;

